In [1]:
# Import Dependencies
import pandas as pd

In [2]:
# Reference the file where the CSV is located---03-18 data
salary_03_19_csv = "salary_03_19_final.csv"

# Import the data into a Pandas DataFrame
salary_03_19 = pd.read_csv(salary_03_19_csv)

In [3]:
salary_03_19.head()

      season            player    salary
0  2002-2003     Kevin Garnett  25200000
1  2002-2003  Damon Stoudamire  13500000
2  2002-2003       Gary Payton  13080000
3  2002-2003         Ray Allen  12375000
4  2002-2003  Latrell Sprewell  12375000

In [4]:
salary_03_19["season"]= salary_03_19["season"].str.split("-", n = 1, expand = True)

In [5]:
salary_03_19.head()

  season            player    salary
0   2002     Kevin Garnett  25200000
1   2002  Damon Stoudamire  13500000
2   2002       Gary Payton  13080000
3   2002         Ray Allen  12375000
4   2002  Latrell Sprewell  12375000

In [14]:
salary_03_19_new = salary_03_19.rename(columns={"season": "Year", "player": "Name","salary":"Salary"})
salary_03_19_new["Year"] = salary_03_19_new["Year"].astype("int")
salary_03_19_new.head()

   Year              Name    Salary
0  2002     Kevin Garnett  25200000
1  2002  Damon Stoudamire  13500000
2  2002       Gary Payton  13080000
3  2002         Ray Allen  12375000
4  2002  Latrell Sprewell  12375000

In [19]:
salary_03_19_new["Year"][0]

2002

In [28]:
salary_10_19 = salary_03_19_new.loc[salary_03_19_new["Year"] >= 2010]

In [29]:
salary_10_16 = salary_10_19.loc[salary_10_19["Year"] <= 2016]

In [31]:
salary_10_16.head()

      Year             Name    Salary
2605  2010      Kobe Bryant  24806250
2606  2010    Zach Randolph  17666666
2607  2010     Vince Carter  17522375
2608  2010    Dirk Nowitzki  17278618
2609  2010  Carmelo Anthony  17149243

In [32]:
salary_10_16.to_csv("salary_10_16.csv", index=False)